Repository: SantiagoChamie/lenski
Catalog: lib/l10n/app_*.arb
Languages: es

# difficultyLight
source: Light
es: Ligero

# difficultyMedium
source: Medium
es: Medio

# difficultyHeavy
source: Heavy
es: Pesado

# difficultyExtreme
source: Extreme
es: Extremo

# difficultyUnknown
source: Unknown
es: Desconocido

# intensityLow
source: low
es: baja

# intensityMedium
source: medium
es: media

# intensityHigh
source: high
es: alta

# intensityExtreme
source: extreme
es: extrema

# courseWithIntensity
source: course with
es: curso con intensidad

# addCoursePrompt
source: Add a course to start learning!
es: ¡Añade un curso para empezar a aprender!

# removeCourseTitle
source: Remove Course
es: Eliminar curso

# removeCoursePrompt
source: Do you want to hide this course or delete it permanently?
es: ¿Quieres ocultar este curso o eliminarlo permanentemente?

source: Hide Course
es: Ocultar curso

source: Delete Permanently
es: Eliminar permanentemente

# confirmDeleteTitle
source: Confirm Deletion
es: Confirmar eliminación

# confirmDeleteMessage
source: Warning: This will permanently delete all data associated with this course including progress, sessions, and saved words. This action cannot be undone.
es: Advertencia: Esto eliminará permanentemente todos los datos asociados con este curso incluyendo progreso, sesiones y palabras guardadas. Esta acción no se puede deshacer.

# errorLoadingCourses
source: Error loading courses Please restart the app or contact support if the issue persists.
es: Error al cargar los cursos Por favor reinicie la aplicación o contacte a soporte si el problema persiste.

source: API Keys
es: Claves API

source: DeepL API Key
es: Clave API DeepL

source: Save API Key
es: Guardar clave API

# usePremiumApi
source: Use Premium DeepL API
es: Usar API Premium de DeepL

source: Translation Settings
es: Ajustes de traducción

# toggleContextual
source: Toggle between contextual and non-contextual translation in the overlay
es: Alternar entre traducción contextual y no contextual en la ventana de traducción

source: Display Settings
es: Ajustes de visualización

# showStreakIndicators
source: Show streak indicators on courses
es: Mostrar indicador de racha en cursos

# useColoredCards
source: Use colored competence cards
es: Usar tarjetas de repaso a color

source: Export
es: Exportar

source: Import
es: Importar

# warningTitle
source: Warning: Data Import
es: Advertencia: Importación de datos

# warningMessage
source: Importing data will replace all your current courses, books, cards, and progress. This action cannot be undone. Do you want to continue?
es: Importar datos reemplazará todos sus cursos, libros, tarjetas y progreso actuales. Esta acción no se puede deshacer. ¿Desea continuar?

source: Cancel
es: Cancelar

source: Import and Replace
es: Importar y reemplazar

# importSuccess
source: Import successful. Please restart the app to see changes.
es: Importación exitosa.

# importFailed
source: Import failed: {error}
es: Error en la importación: {error}

# languageColumnTitle
source: Language
es: Idioma

source: Select source language
es: Seleccionar idioma de origen

source: Select target language
es: Seleccionar idioma de destino

# skillsColumnTitle
source: Skills
es: Habilidades

# goalColumnTitle
source: Goals
es: Metas

# startLearningButton
source: Start learning!
es: ¡Agregar!

# sameLanguageError
source: Source and target languages cannot be the same!
es: ¡Los idiomas de origen y destino no pueden ser iguales!

# noCompetenceError
source: Please select at least one competence!
es: ¡Por favor selecciona al menos una competencia!

# courseExistsError
source: Course already exists!
es: ¡Este curso ya existe!

# languageYouKnowTooltip
source: A language you already know.
es: Un idioma que ya conoces.

# languageToLearnTooltip
source: A language you want to learn.
es: Un idioma que quieres aprender.

source: Select Goal Type
es: Seleccionar tipo de meta

# goalTypeLearnTitle
source: Learn
es: Aprender

# goalTypeLearnDescription
source: Track words learned
es: Seguir palabras aprendidas

# goalTypeDailyTitle
source: Daily
es: Diario

# goalTypeDailyDescription
source: Track study days
es: Seguir días de estudio

# goalTypeTimeTitle
source: Time
es: Tiempo

# goalTypeTimeDescription
source: Track study hours
es: Seguir horas de estudio

source: words per day
es: palabras por día

# oneDailySession
source: 1 daily session
es: 1 sesión diaria

source: minutes per day
es: minutos por día

source: total words
es: en total

source: total days
es: días totales

source: total hours
es: horas totales

# readingCompetence
source: Reading
es: Lectura

# writingCompetence
source: Writing
es: Escritura

# speakingCompetence
source: Speaking
es: Habla

# listeningCompetence
source: Listening
es: Escucha

# readingRequiredTooltip
source: Reading is the base of LenSki's learning method.
es: La lectura es la base del método de aprendizaje de LenSki.

source: Words Today
es: Palabras Hoy

source: Daily Activity
es: Actividad Diaria

source: Minutes Today
es: Minutos Hoy

source: Daily Goal
es: Meta Diaria

source: Day Streak
es: Días Seguidos

# sourceLanguageTitle
source: Source Language
es: Idioma de Origen

# saveChangesButton
source: Save Changes
es: Guardar Cambios

# studyTimeLabel
source: Study time
es: Tiempo de estudio

# wordsAddedLabel
source: Words added
es: Palabras añadidas

# wordsReviewedLabel
source: Words reviewed
es: Palabras repasadas

# linesReadLabel
source: Lines read
es: Líneas leídas

# daysPracticedLabel
source: Days practiced
es: Días practicados

# daysFormat
source: {days} days
es: {days} días

# daysHoursFormat
source: {days} day{plural} {hours} h
es: {days} día{plural} {hours} h

# yearsFormat
source: {years} year{plural}
es: {years} año{plural}

# yearsDaysFormat
source: {years} year{yearPlural} {days} day{dayPlural}
es: {years} año{yearPlural} {days} día{dayPlural}

# goalTooSmallWords
source: Total goal cannot be less than words already added ({wordsAdded})
es: La meta total no puede ser menor que las palabras ya añadidas ({wordsAdded})

# goalTooSmallDays
source: Total goal cannot be less than days already practiced ({daysPracticed})
es: La meta total no puede ser menor que los días ya practicados ({daysPracticed})

# goalTooSmallTime
source: Total goal cannot be less than time already studied ({timeStudied})
es: La meta total no puede ser menor que el tiempo ya estudiado ({timeStudied})

# highlightTextTooltip
source: Highlight text to see its translation
es: Resalta algún texto para ver su traducción

source: Card added successfully
es: Tarjeta añadida exitosamente

# installTtsMessage
source: Install the text-to-speech for this language in your device to access this functionality
es: Instala el texto a voz para este idioma en tu dispositivo para acceder a esta funcionalidad

source: Using contextual translation
es: Usando traducción contextual

source: Using word-only translation
es: Usando traducción sin contexto

source: Card deleted
es: Tarjeta eliminada

# undoAction
source: Undo
es: Deshacer

source: Card updated successfully
es: Tarjeta actualizada exitosamente

# writingCardTooltip
source: How do you write this word?
es: ¿Cómo se escribe esta palabra?

# speakingCardTooltip
source: How do you pronounce this word?
es: ¿Cómo se pronuncia esta palabra?

# readingCardTooltip
source: What does this word mean?
es: ¿Qué significa esta palabra?

# editCardTitle
source: Edit Card
es: Editar Tarjeta

# frontCardLabel
source: Front (word to learn)
es: Frente (palabra a aprender)

# backCardLabel
source: Back (translation)
es: Reverso (traducción)

# contextCardLabel
source: Context (example sentence)
es: Contexto (oración de ejemplo)

# cardTypeLabel
source: Card Type
es: Tipo de Tarjeta

source: Save
es: Guardar

# closeTooltip
source: Close
es: Cerrar

# editCardTooltip
source: Edit card
es: Editar tarjeta

# deleteCardTooltip
source: Delete card
es: Eliminar tarjeta

# getCardTypeDisplay
source: {cardType, select, reading{Reading} writing{Writing} speaking{Speaking} listening{Listening} other{Unknown}}
es: {cardType, select, reading{Lectura} writing{Escritura} speaking{Habla} listening{Escucha} other{Desconocido}}

# hardButton
source: Hard
es: Difícil

# easyButton
source: Easy
es: Fácil

source: No new cards remaining
es: No quedan tarjetas nuevas

# cardsToReview
source: {count, plural, =1{1 card to review} other{{count} cards to review}}
es: {count, plural, =1{1 tarjeta para repasar} other{{count} tarjetas para repasar}}

# refreshCardTooltip
source: Show different card
es: Mostrar otra tarjeta

# addCardTooltip
source: Add new card
es: Añadir tarjeta nueva

# translateTextTooltip
source: Translate front text
es: Traducir texto del frente

source: Context (optional)
es: Contexto (opcional)

# fillFieldsMessage
source: Fill in the front and back fields to create a card
es: Completa los campos de frente y reverso para crear una tarjeta

# contextMustIncludeFrontText
source: The context must include the front text
es: El contexto debe incluir el texto del frente

# addCardButton
source: Add card!
es: ¡Añadir tarjeta!

source: Check answer
es: Verificar respuesta

source: Listen to context
es: Escuchar el contexto

# listenToWordTooltip
source: Listen to the word
es: Escuchar la palabra

# listenToContextTooltip
source: Listen to the example sentence
es: Escuchar la oración de ejemplo

source: Error loading sentences
es: Error al cargar oraciones

source: No sentences found
es: No se encontraron oraciones

source: Error loading books
es: Error al cargar los libros

# textProcessingMessage
source: Your text is being processed, please be patient
es: Tu texto está siendo procesado, por favor ten paciencia

# realLifeInteractionsTitle
source: Real-Life Interactions
es: Interacciones reales

source: Video transcripts
es: Transcripciones de vídeos

source: Conversation logs
es: Registros de conversaciones

source: Interview transcripts
es: Transcripciones de entrevistas

# podcastTranscripts
source: Podcasts transcripts
es: Transcripciones de podcasts

source: Daily dialogues
es: Diálogos cotidianos

source: Travel phrases
es: Frases de viaje

# realLifeInteractionsDescription
source: Great for learning everyday language and common expressions people use in real situations.
es: Excelente para aprender lenguaje cotidiano y expresiones comunes que las personas usan en situaciones reales.

# entertainmentTitle
source: Entertainment
es: Entretenimiento

source: Song lyrics
es: Letras de canciones

source: Books and stories
es: Libros e historias

source: Movie scripts
es: Guiones de películas

source: Movie subtitles
es: Subtítulos de películas

source: TV show scripts
es: Guiones de programas de TV

source: Plays and dialogues
es: Obras y diálogos

# entertainmentDescription
source: Contains various difficulty levels from simple songs to complex narratives. Great for cultural context.
es: Contiene varios niveles de dificultad desde canciones simples hasta narrativas complejas. Excelente para contexto cultural.

# articlesAcademicTitle
source: Articles & Academic
es: Artículos y académico

source: Wikipedia articles
es: Artículos de Wikipedia

source: News articles
es: Artículos de noticias

source: Scientific papers
es: Documentos científicos

source: Blog posts
es: Publicaciones de blogs

source: Educational materials
es: Materiales educativos

source: Specialized vocabulary
es: Vocabulario especializado

# articlesAcademicDescription
source: Perfect for learning formal language and specific vocabulary in different fields of interest.
es: Perfecto para aprender lenguaje formal y vocabulario específico en diferentes campos de interés.

# contentTip
source: Tip: Start with content that matches your interests! Learning is more effective when you enjoy what you're reading.
es: Consejo: ¡Comienza con contenido que coincida con tus intereses! El aprendizaje es más efectivo cuando disfrutas lo que estás leyendo.

# deleteBookTitle
source: Delete Book
es: Eliminar Libro

# deleteBookConfirmation
source: Are you sure you want to delete this book?
es: ¿Estás seguro de que deseas eliminar este libro?

# archiveBookTitle
source: Archive Book
es: Archivar Libro

# archiveBookConfirmation
source: Are you sure you want to archive this book? Archiving will remove all of this book's contents.
es: ¿Estás seguro de que deseas archivar este libro? Archivar eliminará todo su contenido.

# bookTitleLabel
source: Book Title
es: Título del Libro

# imageUrlLabel
source: Image URL
es: URL de Imagen

# enterImageUrlHint
source: Enter image URL
es: Introducir URL de imagen

# languageLabel
source: Language
es: Idioma

# currentProgressLabel
source: Current Progress
es: Progreso Actual

source: lines
es: líneas

# editBookTitle
source: Edit Book
es: Editar Libro

source: Archive book
es: Archivar libro

source: Delete book
es: Eliminar libro

source: Archive
es: Archivar

source: Delete
es: Eliminar

source: Add your own texts!
es: ¡Añade tus propios textos!

# pleaseAddTextOrFile
source: Please add some text or file before creating a book
es: Por favor añade texto o un archivo antes de crear un libro

source: Random sentences
es: Frases aleatorias

source: Real sentences
es: Frases reales

# placeTextHere
source: Place the text here
es: Pega el texto aquí

# poorQualityPdfWarning
source: Poor quality PDFs will not work properly.
es: Los PDF de mala calidad no se extraerán correctamente.

# verticalTextPdfWarning
source: PDFs with vertical text (top to bottom) are not supported
es: No se admiten PDF con texto vertical (de arriba hacia abajo)

# addFilesTypes
source: Add files (.txt .pdf .srt)
es: Añadir archivos (.txt .pdf .srt)

source: Selected file
es: Archivo seleccionado

# languageMismatchTitle
source: Language Mismatch
es: Idioma no coincide

# languageMismatchContent
source: The text's language doesn't match the course's language:
es: El idioma del texto no coincide con el idioma del curso:

source: Add Anyway
es: Añadir de todos modos

# archiveTitle
source: Archive
es: Archivo

# noArchivedBooks
source: Finish books to add them to your archive
es: Termina libros para añadirlos a tu archivo

source: Not Categorized
es: Sin categoría

# deleteArchivedBookTitle
source: Delete Book
es: Eliminar Libro

# deleteArchivedBookConfirmation
source: Are you sure you want to delete this book from your archive?
es: ¿Estás seguro de que deseas eliminar este libro de tu archivo?

# deleteArchivedBookTooltip
source: Delete book
es: Eliminar libro

# editArchivedBookTitle
source: Edit Book
es: Editar Libro

# nameLabel
source: Name
es: Nombre

# categoryLabel
source: Category
es: Categoría

# subcategoryLabel
source: Subcategory (optional)
es: Subcategoría (opcional)
